#ifndef __MESSAGES_H__

#define __MESSAGES_H__

#define MENU_STR \
"МЕНЮ\n" \
"    1. Добавить строку\n" \
"    2. Удалить строку\n\n" \
"    3. Вывод упорядоченной таблицы\n" \
"    4. Вывод неупорядоченной таблицы\n\n" \
"    5. Вывод таблицы ключей\n\n" \
"    6. Вывод статистики\n" \
"    7. Поиск стран по материку и виду спорта\n\n" \
"    0. Выход\n"

#define TABLE_KEYS_HEADER   \
"─────┼─────┼───────────────\n" \
" key │table│\n"    \
"index│index│country name\n"    \
"─────┼─────┼───────────────\n"

#define TABLE_COUNTRIES_HEADER \
"───┼──────────┼──────────┼──────────┼─────────────┼────────────────\n" \
"  i│Название  │ Население│Столица   │Континент    │Вариантная часть\n" \
"───┼──────────┼──────────┼──────────┼─────────────┼────────────────\n"

#define COUNTRY_INPUT_INTRO \
"┼──────────────────────────────────────────────────────────────────────┼\n" \
"│                     ФОРМАТ ВВОДА ДАННЫХ О СТРАНЕ                     │\n" \
"│                                                                      │\n" \
"│[Страна] [число жителей] [столица] [материк] [тип туризма]            │\n" \
"│если тип туризма экскурсионный                                        │\n" \
"│    [число объектов] [тип экскурсий]                                  │\n" \
"│если тип туризма пляжный                                              │\n" \
"│    [сезон] [температура воды] [температуа воздуха] [время перелета]  │\n" \
"│если тип туризма спортивный                                           │\n" \
"│    [вид спорта] [минимальная стоимость]                              │\n" \
"│                                                                      │\n" \
"│Страна, столица: строки на латинице до 10 символов без пробелов       │\n" \
"│Число жителей, число объектов, время полета, минимальная стоимость:   │\n" \
"│        числа от 0 до 4294967295                                      │\n" \
"│Температура воды, воздуха: числа от -2147483648 до 2147483647         │\n" \
"│                                                                      │\n" \
"│Материк: число {Африка: 0, Северная Америка: 1, Антарктида: 2,        │\n" \
"│        Евразия: 3, Южная Америка: 4}                                 │\n" \
"│Тип туризма: число { Экскурсионный: 0, Пляжный: 1, Спортивный: 2 }    │\n" \
"│Тип экскурсии: число { Природа: 0, история: 1, искусство: 2 }         │\n" \
"│Сезон: число { Зима: 0, весна: 1, лето: 2, осень: 3 }                 │\n" \
"│Вид спорта: число { Горные лыжи: 0, серфинг: 1, скалолазание: 2 }     │\n" \
"│                                                                      │\n" \
"│Пример:                                                               │\n" \
"│Russia 146748590 Moscow 3 0 144550 1                                  │\n" \
"┼──────────────────────────────────────────────────────────────────────┼\n"

#define TABLE_STAT_HEADER   \
"─────────────────────────┼──────────────────┼──────────────────\n"  \
"                         │Быстрая сортировка│Сортировка выбором\n"  \
"─────────────────────────┼──────────────────┼──────────────────\n"

#define SEARCH_BY_MAINLAND_AND_SPORT_INTRO \
"┼──────────────────────────────────────────────────────────────────────┼\n" \
"│                    ФОРМАТ ВВОДА ДАННЫХ ДЛЯ ПОИСКА                    │\n" \
"│                                                                      │\n" \
"│[Материк] [вид спорта]                                                │\n" \
"│                                                                      │\n" \
"│Материк: число {Африка: 0, Северная Америка: 1, Антарктида: 2,        │\n" \
"│        Евразия: 3, Южная Америка: 4}                                 │\n" \
"│Вид спорта: число { Горные лыжи: 0, серфинг: 1, скалолазание: 2 }     │\n" \
"│                                                                      │\n" \
"│Пример:                                                               │\n" \
"│1 1                                                                   │\n" \
"┼──────────────────────────────────────────────────────────────────────┼\n"

#endif // __MESSAGES_H__
